# =======================================================
# Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат
# =======================================================


list_1 = []
for i in range(3):
    list_1.append(int(input('введите число от 0 до 1: ')))

for i in list_1:
    left = not (list_1[0] or list_1[1] or list_1[2])
    right = (not list_1[0]) and (not list_1[1]) and (not list_1[2])    

if left == right:
    print('истинное утверждение')
else:
    print('ложное утверждение')
