# ====================================================================
# Задайте список из нескольких чисел.
# Напишите программу, которая найдёт сумму элементов списка,
# стоящих на нечётной позиции
# =====================================================================


list = [int(i) for i in ((input("Введите значения через пробел "))).split()]
print('Исходный список', list)

count = 0

for i in range(1, len(list), 2):
    print(list[i], end=' ')
    count = count + list[i]

print()
print('Сумма на нечетных позициях равна:', count)
