# =======================================================================
# Задайте список. Напишите программу,
# которая определит, присутствует ли в заданном списке строк некое число
# =======================================================================


# Первый вариант
list = input('Введите через пробел: ').split()
list2 = str(input('Введите число: '))

if list2 in list:
    print('yes')


# Второй вариант
a = '12'
lst = ['Строка1', 'Строка2', 'Строка3', 'Строка45', 'Стр12ка']
count = 0
for word in lst:
    if a in word:
        count += 1
print('Да') if count > 0 else print('Нет')
