# ====================================================================
# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:  [2, 3, 4, 5, 6] => [12, 15, 16];  [2, 3, 5, 6] => [12, 15]
# =====================================================================


list = [int(i) for i in ((input("Введите значения через пробел "))).split()]
print('Исходный список', list)
list_output = []

if len(list) % 2 == 0:
    for i in range(len(list)//2):
        list_output.append(list[i]*list[len(list)-1-i])
if len(list) % 2 != 0:
    for i in range(len(list)//2+1):
        list_output.append(list[i]*list[len(list)-1-i])

print('Ответ', list_output)
