# ==================================================================
# Реализуйте алгоритм задания случайных чисел
# без использования встроенного генератора псевдослучайных чисел.
# Подсказка: можно использовать модуль datetime
# ==================================================================


# from datetime import datetime   # включить дял второго варианта
import datetime                   # выключить дял второго варианта

# Первый варинат

print('Первый варинат')


def rand():
    return datetime.datetime.now().microsecond


print(rand())


# Второй варинат

# print('Второй варинат')


# def num_random(n):
#     number = datetime.now().microsecond
#     return number % n


# print((num_random(10) + 89))
