# ==================================================================
# Даны три целых числа. Определите, сколько среди них совпадающих.
# Программа должна вывести одно из чисел: 3 (если все совпадают),
# 2 (если два совпадает) или 0 (если все числа различны)
# ==================================================================

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))

# a, b, c = int(input()), int(input()), int(input()) - альтернативный ввод

# первый вариант
print('Первый вариант:')
arr = [a, b, c]
count = [0, 0, 0]
for i in range(3):
    for j in range(3):
        if arr[i] == arr[j]:
            count[i] += 1
k = max(count)
if k == 1:
    print(0)
else:
    print(k)


# второй вариант
print('Второй вариант:')

def GetNum(a, b, c):
    if a == b == c:
        return 3
    if a == b or b == c or a == c:
        return 2
    return 0


print(GetNum(a, b, c))
