# =======================================================================================
# Измените код одной-двух решенных ранее задач (с прошлых семинаров или домашних работ),
# применив лямбды, filter, map, zip, enumerate, списочные выражения.
# =======================================================================================


# ================================================
# Напишите программу, которая на вход принимает
# числа и находит максимальное из них.
# ================================================

from functools import reduce


list_0 = [int(i) for i in input('Введите 5 чисел через пробел: ').split()]
print(list)

res = reduce(lambda a, b: a if (a > b) else b, list_0)

print('Максимальное число из введенных: ', res)


# ==================================================================
# Даны два целых числа A и В, A>B.
# Выведите все нечётные числа от A до B включительно,
# в порядке убывания. В этой задаче можно обойтись без инструкции if.
# ==================================================================

a, b = 25, 5
list_1 = []
for i in range(b, a+1):
    list_1.append(i)
list_out_1 = filter(lambda i: i % 2 == 0, list_1)
list_out_1 = list(list_out_1)
list_out_1 = sorted(list_out_1, reverse=True)
print(list_out_1)


# ======================================================
# Сложить 2 списка
# ======================================================

list_3 = [4, 1, 5, 2, 3, 6, 5]
list_4 = [6, 2, 8, 5, 3, 9, 1]


def sum(x, y):
    return x+y


list_out_3 = list(map(sum, list_3, list_4))
print(list_out_3)

list_out_3 = list(map(lambda x, y: x+y, list_3, list_4))
print(list_out_3)
