# ========================================================================================
# Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
#    1. с помощью математических формул нахождения корней квадратного уравнения
#    2. с помощью дополнительных библиотек Python
#           ax2 + bx + c = 0
#           D = b2 − 4ac  (дискриминант)
#           если D < 0, корней нет;  если D = 0, есть 1 корень; если D > 0, есть 2  корня.
#           x = (-b +- D^0.5) / (2a)
# =========================================================================================
import math

a = int(input('Введите a: '))
b = int(input('Введите b: '))
c = int(input('Введите c: '))

# a*x**2+b*x+c==0

# дискриминант
d = b**2-4*a*c
print(d)

if d < 0:
    print('корней нет')
elif d == 0:
    x = -b/(2*a)
    print('x=', x)
else:
    x_1 = round((-b+math.sqrt(d))/(2*a), 4)
    x_2 = round((-b-math.sqrt(d))/(2*a), 4)
    print('x_1=', x_1, 'x_2=', x_2,)
