# =======================================================================================
# В единственной строке записан текст. Для каждого слова из данного текста подсчитайте,
# сколько раз оно встречалось в этом тексте ранее.
# Словом считается последовательность непробельных символов идущих подряд,
# слова разделены одним или большим числом пробелов или символами конца строки
# one two one tho three    ответ: 0 0 1 0 0
# =========================================================================================


string = 'one two one tho three'

list = []

list = string.split(' ')
print(list)

dict = {}
for i in list:
    if i in dict:
        dict[i] += 1
    else:
        dict[i] = 0
    print(dict[i], end=' ')

# метод get
