# ==============================================================
# Задайте натуральное число N. Напишите программу,
# которая составит список простых множителей числа N
# ==============================================================

x = int(input('Введите число:'))


d = 2
list = []
while d**2 <= x:
    if x % d == 0:
        list.append(d)
        x = x // d
    else:
        d = d+1
list.append(x)

print(list)
