# ==============================================================
# Задайте последовательность чисел.
# Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности
# ==============================================================


list = [int(i) for i in input('Введите числа через пробел: ').split()]
print(list)

list_res = []

for i in list:
    temp = list.count(i)
    if temp < 2:
        list_res.append(i)

print(list_res)
