# ======================================================
# Задайте строку из набора чисел. Напишите программу,
# которая покажет большее и меньшее число.
# В качестве символа-разделителя используйте пробел.
# ======================================================


list = [int(i) for i in input('Введите числа через пробел: ').split()]
print(list)

a = max(list)
b = min(list)
print(a, b, sep=' ')
