# =======================================================================================
# Дан текст: в первой строке задано число строк, далее идут сами строки.
# Выведите слово, которое в этом тексте встречается чаще всего.
# Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.
# =======================================================================================


dict = {}
text = 'apple orange banana banana orange'
text = text.split()

for i in range(1, len(text)-1):
    if text[i] not in dict: 
        dict[text[i]] = 1
    else: 
        dict[text[i]] += 1

list=[]

for k, v in dict.items():
    if v == (max(dict.values())):
        list.append(k)

list.sort()
print(list[0])

