# =======================================================================================
# Вам дан словарь, состоящий из пар слов.
# Каждое слово является синонимом к парному ему слову. Все слова в словаре различны.
# Для слова из словаря, записанного в последней строке, определите его синоним.
# =======================================================================================


dict = {'Hello': 'Hi',
        'Bye': 'Goodbye',
        'List': 'Array'}
find_1 = 'Bye'
find_2 = 'Goodbye'


# Ищем по ключу Bye
if find_1 in dict.keys():
    print(dict[find_1])

# Ищем по значению Goodbye ключ к нему
if find_2 in dict.values():
    ind = list(dict.values()).index(find_2)
    print(list(dict.keys())[ind])
