# ========================================================================
# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# ========================================================================

text = 'папа мама вабвро свой абвревиатура солнце тиабвск'

list = text.split()

for word in list:
    if 'абв' in word:
        list.remove(word)

text_res = ' '.join(list)  # пеобразование спикок строк в строку

print('Ответ: ', text_res)
